[ {"id": "1",
    "name" : "Corporate Finance",
    "paragraph_1" : "The ultimate objective of the service is to create liquidity, ensure financial stability for operations and third-party confidence in the client company.",
    "paragraph_2" : "The offering is structured to play an important role as part of the boardroom strategic advisory team on all matters affecting the company’s development and growth, advising on any planned strategic moves such as mergers, acquisitions and disposals and developing and executing appropriate financial solutions. Our financial advisory activities include advice on: equity issuance; balance sheet restructuring; financial modelling and business appraisals (valuations).",
    "paragraph_3" : "Our Corporate Finance unit works with clients on a number of areas such as: capital structure; distribution policy; liquidity; cost of capital; value drivers and risk management. The team provides an outside view to senior executives in order to drive value-enhancing decisions. The aim of our dialogue is to arrive at definitive actionable decisions implementable in specific timeframes to drive corporate value.",
    "paragraph_4" : "Our in-depth expertise extends to a wide range of strategic M&amp;A transactions, including asset purchases and dispositions, restructurings and reorganizations. With our strong relationships with many of the leading international financial institutions we aim to assist clients in the implementation of any agreed strategic decisions.",
    "paragraph_5" : "Our debt capital market practice under this product focusses significantly on on-balance sheet lending to private and public corporates within the entire spectrum of the business cycle."

   

},

{"id": "2",
    "name" : "Structured Finance",
    "paragraph_1" : "Traditional balance sheet lending is drying up and has become unattractive to many financiers in the sub-region. Collateral-backed lending has become unattractive to lenders who have appetite for African debt. Our structured finance practice recognizes the unique challenges balance sheets in our markets face in raising capital for CAPEX, working capital and other complex financing requirements. Through our structured finance practice, we have succeeded in engineering financing solutions that avoid weak and unattractive balance sheets to finance some of the most complex transactions in Africa.",
    "paragraph_2" : "Weak balance sheets may not necessarily mean bad businesses. They may be the result of temporary gaps in cash flow. It is our firm conviction that these situations present opportunities to find creative ways of unleashing other untapped cash flows within the business. Our structured finance solutions are employed to allow businesses to access funding without recourse to their balance sheets. Through this product we have enabled many businesses to leverage the profile and balance sheets of their related parties to raise capital to meet specific financing needs without overburdening their balance sheets.",
    "paragraph_3" : "In the last five years we have successfully employed this off-balance sheet lending approach to assist major private and public corporates to ring-fence various cash flows to raise approximately US$1 billion in debt to solve very difficult cash flow challenges faced by these firms.",
    "paragraph_4" : "Our PPP practice takes a significant cue from the attractiveness of structured finance to both local and international banks and funds that have appetite for various project finance opportunities in Africa."

   

}
,

{"id": "3",
    "name" : "Project Finance",
    "paragraph_1" : "Our aim is to oﬀer a one-stop service to governments and communities for the planning, procurement and ﬁnancing to construction, implementation and  management.",
    "paragraph_2" : "A major stakeholder in project ﬁnancing are equity providers, who would typically be “sponsors” of such projects. The other half of the financing system are a “syndicate” of banks or other lending institutions that provide loans to the operation. Value addition is our overriding motivation in our project finance practice.",
    "paragraph_3" : "We seek to enhance the entire value chain from project conception, development, structuring and most importantly financing. A major contribution we bring to these transactions is our ability to apply our structuring expertise to mitigate project risks to make them attractive to financiers. We understand Africa. This unique advantage allows us to introduce and leverage risk mitigation instruments and tools that cater specifically to these risks.",
    "paragraph_4" : "We work closely with other professional teams of technical and legal advisors to ensure that the spectrum of financing activities is fully informed by their input to protect all parties involved in project finance initiatives we advise on."

   

}

,

{"id": "4",
    "name" : "Mergers & Acquisitions",
    "paragraph_1" : "Africa has enormous M&amp;A opportunities. Our aim is to provide advice and raise capital on a full suite of transactions raging from mergers, acquisitions, leveraged buyouts, joint ventures, spin-offs, divestitures and other restructuring initiatives.",
    "paragraph_2" : "C-NERGY’s M&amp;A product offers clients: due diligence reviews; valuation, post-acquisition and/or merger integration and portfolio alignment and value harvesting; turnaround management and exit planning services.",
    "paragraph_3" : "As part of due diligence exercises, depending on the nature, size and scope of each assignment, we work with some of the most credible local and international Law firms, Accounting and Audit firms as well as other professionals with expertise in the various industries to help clients flesh out their investment thesis to maximize return on investment. We then work with clients to test the investment thesis by concentrating on the big issues that will determine the deal&#39;s ultimate success, and help clients develop an agenda for creating value once the deal is closed. In performing our review, we assess key industry performance issues and cash flow drivers. We also pay specific attention to economic and other environmental issues that impact business outcomes.",
    "paragraph_4" : "Upon successfully completing an acquisition, we offer post-acquisition integration and portfolio alignment advise, to assist our clients to develop a strategic blueprint for the consolidated newly enlarged group; facilitate workshops and discussions that align the respective management teams to the new strategic priorities of the merged entity. We investigate revenue enhancement strategies and cost reduction initiatives as part of this value enhancing service.",
    "paragraph_5" : " For distressed turnarounds, we aim to provide cross-disciplinary interim management support for defined financial restructuring, as well as, strategic, operational and organizational transformations. Our exit planning practice ensures that investors consummate deals with maximum return by preparing for exits, identifying the optimal exit strategies, preparing the sale documents and pre-qualifying buyers."

   

}
,

{"id": "5",
    "name" : "PPP Solutions",
    "paragraph_1" : "Our aim is to oﬀer a one-stop service to governments and communities managing the planning, feasibility studies, ﬁnancing, design, procurement, construction, management and operation of Public-Private Partnerships (PPPs).",
    "paragraph_2" : "These value chain functions are organized under Transaction Advisory Services, Capital Raising Services, Programme Management Services, and Education &amp; Training Services. While in a PPP, the government joins hands with the private sector to deliver a public service, while sharing the risks and rewards, it is the government that establishes the project goals while the private sector takes responsibility for achieving them.",
    "paragraph_3" : "C-NERGY assists government to establish these goals and structure PPPs to enable eﬃcient risk sharing across the entire value chain to manage the cost of PPPs."
   
   

}
]