[ {"id": "1",
    "name" : "MICHAEL N.A. COBBLAH",
    "role" : "Chief Executive Officer",
    "description" : "<p>Mike is the Chief Executive Officer at C-NERGY and a Director of the Firm with over 25years of professional experience.&nbsp; He has led the team during its four years of existence and have advised both government and private sector led transactions worth several billions of dollars.&nbsp; His key strengths are in deal origination and execution and providing leadership for negotiations and execution.&nbsp;<br><br>Prior to co-founding C-NERGY, Mike was Country Representative for Ecobank Capital where for 8 years he was responsible for the total investment banking business of the Group covering brokerage, asset management and corporate finance across Anglophone West Africa. He previously worked in various capacities with PricewaterhouseCoopers Ghana, Merchant Bank Ghana Ltd and the Ministry of Finance as Manager, Corporate Finance and Recovery Services, Senior Investment Analyst, and Investment and Project Analyst respectively.<br>Mike has served on several Boards including the Ghana Stock Exchange Council for two terms, Chaired the Government of Ghana’s Bond Market Advisory Committee from 2012 to 2014 and also served on the Government’s PPP Advisory Committee.&nbsp; He is among the few honoured professionals in the AIESEC Hall of Fame and the current Chairman of AIESEC In Ghana.&nbsp; He is also a Member of the Governing Board of African Association of Consultants, Valuers and Analysts (AACVA).<br></p> <p>Mike holds an MBA from University of Birmingham and a BSc (Administration) degree from the University of Ghana.&nbsp;He is a Certified Valuation Analyst of the International Association of Consultants, Valuers and Analysts, Toronto Canada.<br>&nbsp;</p>",
    "image": "michael.jpg"
   

},

{"id": "2",
    "name" : "NANA AMOTO MENSAH",
    "role" : "Director",
    "description" : "<p>Nana is a co-founder of C-NERGY with over 16 years of investment banking experience covering pension and investment consulting, asset management, research, business development and training.<br></p> <p>Nana has led and also assisted in providing major investment banking assignments for both corporates and public sector institutions across sectors like telecoms, infrastructure, energy, real estate, aviation, commodities and finance across the sub-region.<br></p> <p>He has structured and obtained financing for acquisitions, management buy-outs, expansion and recapitalization of institutions. He has executed transactions collectively in excess of US$6 billion.<br></p><p>Prior to co-founding C-NERGY, Nana was the Head of the Corporate Finance unit of Ecobank Capital for Anglophone West Africa (excluding Nigeria). Prior to joining Ecobank Capital, Nana was an Assistant Vice President at Boulders Advisors Limited an investment advisory firm in Ghana.<br></p><p>Nana holds an MPhil (Economics) and a Bachelor of Arts Degree (Economics), both from the University of Ghana. He is a member of the International Association of Certified Valuators and Analysts (IACVA Africa).&nbsp;<br></p>",
    "image": "nana.jpg"
   

},

{"id": "3",
    "name" : "EVELYN KING",
    "role" : "Associate",
    "description" : "<p>Evelyn is an Associate with C-NERGY Ghana Limited with specialty in Banking & Finance, Oil and Gas and Public Private Partnerships (PPP). She has researched extensively in her coverage sectors to meet the unique and peculiar needs of our clients across the Region. <br><br>Evelyn was the Conference Manager for the firm’s 3rd Global Public Private Partnership Conference which hosted over 300 delegates from the sub-region. She has worked on major energy, PPP and oil and gas pipeline transactions collectively in excess of US$ 1 billion<br>.Prior to joining C-NERGY, Evelyn was the Vice President (Finance Legal and Administration) at AIESEC and the African Regional Education Chair of the AIESEC International Finance and Legal Board.<br></p><p>At AIESEC, she worked closely with PricewaterhouseCoopers Ghana, L’Oreal Ghana and Standard Chartered Bank in fulfilling their Corporate Social Responsibility initiatives and Student Outreach Activities.<br></p><p>Evelyn holds a BSc. (Administration-Banking and Finance) degree from the University of Ghana Business School.&nbsp;She is also an Associate Member of the International Association of Consultants, Valuers & Analyst (IACVA). She has also attended several conferences including the Harvard Africa Business Conferences and the AfDB Annual Conferences<br></p>",
    
    "image": "evelyn.jpg"
   

},

{"id": "4",
    "name" : "ALFRED KUDJORDJI-MENSAH",
    "role" : "Associate",
    "description" : "<p>Alfred is an Associate at C-NERGY, covering Financial Services, Agriculture,</p><p>Infrastructure and Telecommunication sectors. He has expertise in creating financial</p><p>models, preparing and presenting investment analyses, assisting with investor</p><p>presentations, and compiling sector and market specific research.</p> <p>Prior to joining C-NERGY, Alfred was heavily involved in the underwriting, acquisition,</p><p>and development of multiple real estate asset classes including offices, residential and</p><p>hospitality as well as deal origination for new business opportunities.</p><p><br></p><p>He has also held roles in management consulting and research, advising both local and</p><p>multinational clients in Agribusiness and Financial Services sectors. Alfred is a certified</p><p>Financial Modeling and Valuation Analyst (FMVA).</p><p>He holds a Master’s Degree in Development Finance and BSc in Agricultural Economics</p><p>from the University of Ghana.<br></p>",
    "image": "al.jpg"
   

}
]